# SELECT Aninhado

Ativando uma conexão de banco de dados em memória usando o SGBD H2:

## Exemplo dos Táxis

Baseado no exemplo criado por prof. Geovane Cayres Magalhães http://www.ic.unicamp.br/~geovane/mo410-091/caso.html

In [ ]:
drop database if exists taxis;
create database if not exists taxis;

In [ ]:
show databases;

In [ ]:
USE taxis;

## Primeiro conjunto de tabelas para consultas básicas

In [ ]:
DROP TABLE IF EXISTS Taxi;
DROP TABLE IF EXISTS Cliente;
DROP TABLE IF EXISTS Corrida;

CREATE TABLE Taxi (
  Placa VARCHAR(7) NOT NULL,
  Marca VARCHAR(30) NOT NULL,
  Modelo VARCHAR(30) NOT NULL,
  AnoFab INTEGER,
  Licenca VARCHAR(9),
  PRIMARY KEY(Placa)
);

CREATE TABLE Cliente (
  CliId VARCHAR(4) NOT NULL,
  Nome VARCHAR(80) NOT NULL,
  CPF VARCHAR(14) NOT NULL,
  PRIMARY KEY(CliId)
);

CREATE TABLE Corrida (
  CliId VARCHAR(4) NOT NULL,
  Placa VARCHAR(7) NOT NULL,
  DataPedido DATE NOT NULL,
  PRIMARY KEY(CliId, Placa, DataPedido),
  FOREIGN KEY(CliId)
    REFERENCES Cliente(CliId)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION,
  FOREIGN KEY(Placa)
    REFERENCES Taxi(Placa)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

In [ ]:
INSERT INTO Cliente VALUES ('1532', 'Asdrúbal', '448.754.253-65');
INSERT INTO Cliente VALUES ('1755', 'Doriana', '567.387.387-44');
INSERT INTO Cliente VALUES ('1780', 'Quincas', '546.373.762-02');

INSERT INTO Taxi VALUES ('DAE6534', 'Ford', 'Fiesta', 1999, 'MN572345');
INSERT INTO Taxi VALUES ('DKL4598', 'Wolkswagen', 'Gol', 2001, 'AU876543');
INSERT INTO Taxi VALUES ('DKL7878', 'Ford', 'Fiesta', 2001, 'OP102938');
INSERT INTO Taxi VALUES ('JDM8776', 'Wolkswagen', 'Santana', 2002, 'QM365923');
INSERT INTO Taxi VALUES ('JJM3692', 'Chevrolet', 'Corsa', 1999, 'UU335577');

INSERT INTO Corrida VALUES ('1755', 'DAE6534', '2003-02-15');
INSERT INTO Corrida VALUES ('1780', 'JDM8776', '2003-02-18');
INSERT INTO Corrida VALUES ('1755', 'DKL7878', '2003-02-16');
INSERT INTO Corrida VALUES ('1780', 'DKL4598', '2003-02-17');
INSERT INTO Corrida VALUES ('1532', 'DKL4598', '2003-02-18');
INSERT INTO Corrida VALUES ('1780', 'DAE6534', '2003-02-16');

## Segundo conjunto de tabelas para consultas avançadas

In [ ]:
DROP TABLE IF EXISTS Motorista;
DROP TABLE IF EXISTS Zona;
DROP TABLE IF EXISTS Fila;

CREATE TABLE Motorista (
  CNH VARCHAR(6) NOT NULL,
  Nome VARCHAR(80) NOT NULL,
  CNHValid INTEGER,
  Placa VARCHAR(7) NOT NULL,
  PRIMARY KEY(CNH),
  FOREIGN KEY(Placa)
    REFERENCES Taxi(Placa)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

CREATE TABLE Zona (
  Zona VARCHAR(40) NOT NULL,
  PRIMARY KEY(Zona)
);

CREATE TABLE Fila (
   Zona VARCHAR(40) NOT NULL,
   CNH VARCHAR(6) NOT NULL,
   DataHoraIn TIMESTAMP,
   DataHoraOut TIMESTAMP,
   KmIn INTEGER,
   PRIMARY KEY (Zona, CNH),
   FOREIGN KEY(Zona)
     REFERENCES Zona(Zona)
       ON DELETE NO ACTION
       ON UPDATE NO ACTION,
   FOREIGN KEY(CNH)
     REFERENCES Motorista(CNH)
       ON DELETE NO ACTION
       ON UPDATE NO ACTION
);

In [ ]:
INSERT INTO Taxi VALUES ('DXF5263', 'Ford', 'Escort', 2001, 'GG5263526');
INSERT INTO Taxi VALUES ('MJN6578', 'Wolkswagen', 'Santana', 1998, 'KL856326');
INSERT INTO Taxi VALUES ('MLA4545', 'Wolkswagen', 'Gol', 2000, 'YK6574837');
INSERT INTO Taxi VALUES ('DXA7878', 'Ford', 'Escort', 2000, 'GG5263526');
INSERT INTO Taxi VALUES ('DXF6767', 'Wolkswagen', 'Santana', 1998, 'YK7890081');
INSERT INTO Taxi VALUES ('DXF6868', 'Wolkswagen', 'Santana', 1998, 'YK7890082');

INSERT INTO Motorista VALUES ('657483', 'Asdrubal', 1, 'DXF5263');
INSERT INTO Motorista VALUES ('567892', 'Quincas', 1, 'MLA4545');
INSERT INTO Motorista VALUES ('452635', 'Zandor', 1, 'DXA7878');
INSERT INTO Motorista VALUES ('452452', 'Alcebiades', 1, 'DXF6767');
INSERT INTO Motorista VALUES ('555555', 'Bonerges', 1, 'DAE6534');
INSERT INTO Motorista VALUES ('987654', 'Doriana', 1, 'JDM8776');
INSERT INTO Motorista VALUES ('389204', 'Melissa', 1, 'DXF6868');

INSERT INTO Zona VALUES ('Barão Geraldo');
INSERT INTO Zona VALUES ('Cambuí');
INSERT INTO Zona VALUES ('Taquaral');
INSERT INTO Zona VALUES ('Unicamp');

INSERT INTO Fila VALUES ('Barão Geraldo', '567892', '2002-06-05 09:00:00', '2002-06-05 09:30:00', 4630);
INSERT INTO Fila VALUES ('Barão Geraldo', '657483', '2002-06-05 07:30:00', '2002-06-05 07:45:00', 1567);
INSERT INTO Fila VALUES ('Taquaral', '452452', '2002-06-05 09:00:00', '2002-06-05 09:50:00', 5000);
INSERT INTO Fila VALUES ('Taquaral', '657483', '2002-06-06 08:00:00', '2002-06-06 08:07:00', 7900);
INSERT INTO Fila VALUES ('Unicamp', '452635', '2002-06-02 08:00:00', '2002-06-02 08:00:00', 4800);
INSERT INTO Fila VALUES ('Unicamp', '567892', '2002-06-06 06:00:00', '2002-06-06 06:00:00', 5263);
INSERT INTO Fila VALUES ('Unicamp', '657483', '2002-06-06 23:00:00', '2002-06-06 23:00:00', 4541);
INSERT INTO Fila VALUES ('Unicamp', '452452', '2002-06-05 10:30:00', '2002-06-05 10:30:00', 7800);
INSERT INTO Fila VALUES ('Taquaral', '555555', '2002-06-06 08:10:00', '2002-06-06 08:10:00', 7910);
INSERT INTO Fila VALUES ('Unicamp', '987654', '2002-06-05 10:30:00', '2002-06-05 10:35:00', 7850);

## Filas de Taxis

In [ ]:
SELECT * FROM Fila F;

# Aninhamento de consulta

### Todas as Zonas disponíveis

In [ ]:
SELECT Z.zona
       FROM Zona Z;

### Somente Zonas que receberam algum taxi na fila (sem aninhamento)

In [ ]:
SELECT DISTINCT F.zona
       FROM Fila F;

## Aninhando com IN / NOT IN

### Somente Zonas que receberam algum taxi na fila (com aninhamento / IN)

In [ ]:
SELECT Z.zona
FROM Zona Z
WHERE Z.zona IN (SELECT DISTINCT F.zona FROM Fila F);

### Zonas que não receberam algum taxi na fila (com aninhamento / NOT IN)

In [ ]:
SELECT Z.zona
FROM Zona Z
WHERE Z.zona NOT IN (SELECT DISTINCT F.zona FROM Fila F);

## Aninhando com EXISTS / NOT EXISTS

### Somente Zonas que receberam algum taxi na fila (com aninhamento / EXISTS)

In [ ]:
SELECT Z.zona
FROM Zona Z
WHERE EXISTS (SELECT * FROM Fila F WHERE F.zona = Z.zona);

### Zonas que não receberam algum taxi na fila (com aninhamento / NOT EXISTS)

In [ ]:
SELECT Z.zona
FROM Zona Z
WHERE NOT EXISTS (SELECT * FROM Fila F WHERE F.zona = Z.zona);

## Exemplo com aninhamento e Modelo

### Taxis modelo Fiesta

In [ ]:
SELECT T.placa, T.modelo FROM Taxi T WHERE T.modelo = 'Fiesta';

### Nome dos clientes que andaram nos taxis modelo Fiesta (sem aninhamento)

In [ ]:
SELECT DISTINCT Cl.nome
FROM Cliente Cl, Corrida Co, Taxi Tx
WHERE Cl.cliid = Co.cliid AND Co.placa = Tx.placa AND
      Tx.modelo = 'Fiesta';

### Nome dos clientes que andaram nos taxis modelo Fiesta (com aninhamento)

In [ ]:
SELECT DISTINCT Cl.nome
FROM Cliente Cl, Corrida Co
WHERE Cl.cliid = Co.cliid AND
      Co.placa IN (SELECT Tx.placa FROM Taxi Tx
                   WHERE Tx.modelo = 'Fiesta');

## Comparação com SELECT aninhado

### Nome dos clientes que andaram no taxi dirigido por Bonerges

In [ ]:
SELECT DISTINCT Cl.nome
FROM Cliente Cl, Corrida Co
WHERE Cl.cliid = Co.cliid AND
      Co.placa = (SELECT Tx.placa
                  FROM Taxi Tx, Motorista Mo
                  WHERE Tx.placa = Mo.placa AND
                        Mo.nome = 'Bonerges');

### Taxis que entraram na fila antes da primeira entrada de Alcebiades

In [ ]:
SELECT Mo.placa, Fi.datahorain
FROM Motorista Mo, Fila Fi
WHERE Mo.cnh = Fi.cnh AND
      Fi.datahorain < (SELECT MIN(F.datahorain)
                       FROM Motorista M, Fila F
                       WHERE M.cnh = F.cnh AND
                             M.nome = 'Alcebiades');

### Horários de entrada de motoristas em todas as filas

In [ ]:
SELECT datahorain FROM Fila;

## Comparação usando ALL / ANY

### Quem foi o primeiro motorista a entrar em alguma fila (independentemente da fila)

In [ ]:
SELECT Mo.nome, Fi.datahorain
FROM Motorista Mo, Fila Fi
WHERE Mo.cnh = Fi.cnh AND
      Fi.datahorain <= ALL (SELECT datahorain FROM Fila);

### Quem foi o primeiro motorista a entrar na fila de cada uma das zonas

In [ ]:
SELECT Mo.nome, Fi_externa.zona, Fi_externa.datahorain
FROM Motorista Mo, Fila Fi_externa
WHERE Mo.cnh = Fi_externa.cnh AND
      Fi_externa.datahorain <= ALL (SELECT Fi_interna.datahorain
                                    FROM Fila Fi_interna
                                    WHERE Fi_externa.zona = Fi_interna.zona);

### Quem não foi o primeiro motorista a entrar na fila de cada uma das zonas

In [ ]:
SELECT Mo.nome, Fi_externa.zona, Fi_externa.datahorain
FROM Motorista Mo, Fila Fi_externa
WHERE Mo.cnh = Fi_externa.cnh AND
      Fi_externa.datahorain > ANY (SELECT Fi_interna.datahorain
                                   FROM Fila Fi_interna
                                   WHERE Fi_externa.zona = Fi_interna.zona)
ORDER BY Fi_externa.zona;

## SELECT como Tabela Aninhada

### Média de Táxis por Zona

Considere o seguinte SELECT que computa o número de táxis na fila de cada zona.

In [ ]:
SELECT F.zona, COUNT(*) n_taxis
       FROM Fila F
       GROUP BY F.zona;

Este SELECT pode ser transformado em uma tabela de um outro SELECT que calcula a média.

In [ ]:
SELECT AVG(FT.n_taxis)
       FROM (SELECT F.zona, COUNT(*) n_taxis
             FROM Fila F
             GROUP BY F.zona) FT;

# Aninhamento na Atualização (`UPDATE/SELECT`)

O SELECT aninhado pode ser parte de uma operação de UPDATE.

Considere as relações de todos os motoristas e aqueles que estão na fila. Note que todos os motoristas têm CNH válido.

In [ ]:
-- Todos os Motoristas
SELECT M.CNH, M.CNHValid
       FROM Motorista M;
-- Motoristas na Fila
SELECT DISTINCT F.CNH
       FROM Fila F;

A seguinte consulta retorna aqueles motoristas que não estão em nenhuma fila.

In [ ]:
SELECT M.CNH
       FROM Motorista M
       WHERE M.CNH NOT IN (
           SELECT DISTINCT F.CNH
           FROM Fila F);

Usando o UPDATE com SELECT aninhado, é possível invalidar o CNH de todos os motoristas que não aparecem em nenhuma fila.

In [ ]:
UPDATE Motorista M
       SET M.CNHValid = 0
       WHERE M.CNH NOT IN (
           SELECT DISTINCT F.CNH
           FROM Fila F);

SELECT * FROM Motorista;

# Aninhamento na Exclusão (`DELETE/SELECT`)

In [ ]:
DELETE FROM Motorista  
WHERE Motorista.CNH NOT IN (          
                            SELECT DISTINCT F.CNH            
                            FROM Fila as F
); 
           
SELECT * FROM Motorista;

In [ ]:
SELECT * FROM Motorista;